---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.FabricHostReference.CutByCover
enum: Autodesk.Revit.DB.Structure.FabricHostReference
source: html/dd131f0d-8479-5f9b-49c2-3e3ac32151cf.htm
---
# Autodesk.Revit.DB.Structure.FabricHostReference.CutByCover

The fabric is cut by the host cover.